app/views/homes/show.html.erb

      <% like = nil%>
    <% current_user.homelikes.each do |homelike|%>
---
SELECT "homelikes".* FROM "homelikes" WHERE "homelikes"."user_id" = ?  [["user_id", 1]]

<ul>
 <% @home.home_review.each do |home_review|%>
---
SELECT "home_reviews".* FROM "home_reviews" WHERE "home_reviews"."home_id" = ? ORDER BY created_at DESC  [["home_id", 1]]