app/controllers/homes_controller.rb

SELECT "homes".* FROM "homes"
---
  def index
    @homes = Home.all

SELECT "homes".* FROM "homes" WHERE "homes"."user_id" = ? AND "homes"."id" = ? LIMIT ?  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
---
  def correct_user
    @homes =  current_user.homes.find_by(id: params[:id])

SELECT "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @homes = Home.find(params[:id])

INSERT INTO "homes" ("name", "address", "room_number", "price", "created_at", "updated_at", "user_id", "detail") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @home = current_user.homes.build(home_params)
    @home.user_id = current_user.id
    respond_to do |format|
      if @home.save

UPDATE "homes" SET "price" = ?, "updated_at" = ? WHERE "homes"."id" = ?  [["price", 6000000], ["updated_at", "2021-12-13 14:20:28.597722"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @home.update(home_params)

SELECT "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def publish
    homes = Home.find params[:id]

SELECT "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_home
      @home = Home.find(params[:id])