app/controllers/homelikes_controller.rb

  def index
    @homes = Home.all
---
SELECT "homes".* FROM "homes"

  def create
    @homelike = Homelike.new(homelike_params)
    @homelike.user_id = current_user.id
    respond_to do |format|
      if @homelike.save
---
INSERT INTO "homelikes" ("user_id", "home_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["home_id", 1], ["status", 1], ["created_at", "2021-12-13 09:49:42.541144"], ["updated_at", "2021-12-13 09:49:42.541144"]]