app/views/homelikes/index.html.erb

SELECT "homes".* FROM "homes"
SELECT "homelikes".* FROM "homelikes" WHERE "homelikes"."user_id" = ?  [["user_id", 1]]
---
  <tbody>
  <% current_user.homelikes.each do |homelike| %>